app/views/shared/_stats.html.erb

SELECT COUNT(*) FROM "measurements" WHERE ("measurements".user_id = 1)
---
        <span id="measurements" class="stat">
            <%= pluralize(@user.measurements.count, "measurement") %>