app/views/shared/_user_info.html.erb

      <span style="font-size: 0.8em;">
        <%= pluralize(@user.microposts.count, "micropost") %>
---
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)