app/controllers/geigercounters_controller.rb

  def create
    fileUp = params[:upload]
    orig_filename =  fileUp['datafile'].original_filename
    filename = sanitize_filename(orig_filename)
    filename = create_random_name + filename
    AWS::S3::S3Object.store(filename, fileUp['datafile'].read, @@BUCKET, :access => :public_read)
    url = AWS::S3::S3Object.url_for(filename, @@BUCKET, :authenticated => false)
    @geigercounter = Geigercounter.new(params[:geigercounter])
    @geigercounter.user = current_user
    @geigercounter.filename = filename
    @geigercounter.url = url;
    if @geigercounter.save
---
INSERT INTO "geigercounters" ("name", "tolerance", "manufacturer", "url", "filename", "user_id", "created_at", "updated_at") VALUES ('Harry', 25, '', '/images/gjtgioubfjdquhxrebjhjapan.jpg', 'gjtgioubfjdquhxrebjhjapan.jpg', 1, '2011-03-31 17:48:06.005624', '2011-03-31 17:48:06.005624') RETURNING "id"

  def destroy
    AWS::S3::S3Object.find(@geigercounter.filename, @@BUCKET).delete
---
DELETE FROM "geigercounters" WHERE "geigercounters"."id" = 1