app/controllers/measurements_controller.rb

  def create
    @measurement = current_user.measurements.build(params[:measurement])
    if @measurement.save
---
INSERT INTO "measurements" ("name", "content", "lat", "lon", "msph", "user_id", "created_at", "updated_at") VALUES (NULL, 'Wow. ', NULL, NULL, 1.0, 1, '2011-03-27 19:24:20.559020', '2011-03-27 19:24:20.559020') RETURNING "id"