app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "lat", "lon", "msph", "user_id", "created_at", "updated_at") VALUES ('Voll Normal ', NULL, NULL, NULL, 1, '2011-03-26 22:46:19.211215', '2011-03-26 22:46:19.211215') RETURNING "id"
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save