app/controllers/page_controller.rb

  def home
    if signed_in?
      @measurement = Measurement.new
      @measurement.msph = 1;
      @feed_items = current_user.feed.paginate(:page => params[:page])
      @user = current_user
      @followers = @user.followers.paginate(:page => 1)
      @following = @user.following.paginate(:page => 1)
    else
      @forShow = Measurement.all
---
SELECT "measurements".* FROM "measurements" WHERE (user_id IN (SELECT followed_id FROM relationships