app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:followed_id])
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 1 AND ("relationships".follower_id = 3) LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1