app/controllers/users_controller.rb

  def show
#    @user = User.find(params[:id])
    @user = User.find_by_username(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1