app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("username", "fullname", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('reiz', 'Robert Reiz', 'reiz@ploin.de', '2011-03-24 06:32:20.197535', '2011-03-24 06:32:20.197535', 'e0d00bad43d21ebaf0fb367c9980dc11d4ea30c9311ab056613d2d38c7ad19bf', 'dda839f527652c932e073c39a0d8ded267a276b863f7931df8e44dc2ec71905d', 'f') RETURNING "id"

  def edit
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'reiz' LIMIT 1

  def update
    p params[:id]
    @user = User.find_by_username(params[:id])
    p @user
    if @user.update_attributes(params[:user])
---
SELECT "users"."id" FROM "users" WHERE ("users"."username" = 'reiz') AND ("users".id <> 1) LIMIT 1
UPDATE "users" SET "fullname" = 'Robert Reizi', "updated_at" = '2011-03-24 16:03:35.640346' WHERE "users"."id" = 1

  def show
    @user = User.find_by_username(params[:id])
    if @user.nil?
      redirect_to "/home"
    else
      @followers = @user.followers.paginate(:page => 1)
      @following = @user.following.paginate(:page => 1)
      @measurements = @user.measurements.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'reiz' LIMIT 1
SELECT "measurements".* FROM "measurements" WHERE ("measurements".user_id = 1) ORDER BY measurements.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "measurements" WHERE ("measurements".user_id = 1)

  def index
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0

  def following
    @title = "Following"
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'reiz' LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'reiz' LIMIT 1

  def geigercounter
    @title = "Geiger counter"
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'reiz' LIMIT 1